#include "C8051F020.h"
#include "adc.h"
//正弦波数据表,俺用wps的表格功能算的哟！
//code unsigned  int sintab[100]={2048 ,2178 ,2307 ,2436 ,2562 ,2687 ,2809 ,2928 ,3044 ,3155 ,3262 ,3364 ,3461 ,3552 ,3638 ,3716 ,3788 ,3853 ,3911 ,3961 ,4004 ,4038 ,4065 ,4083 ,4094 ,4095 ,4090 ,4075 ,4053 ,4022 ,3983 ,3937 ,3883 ,3822 ,3753 ,3678 ,3596 ,3508 ,3414 ,3314 ,3209 ,3100 ,2986 ,2869 ,2748 ,2625 ,2499 ,2372 ,2243 ,2113 ,1983 ,1853 ,1724 ,1597 ,1471 ,1348 ,1227 ,1110 ,996 ,887 ,782 ,682 ,588 ,500 ,418 ,343 ,274 ,213 ,159 ,113 ,74 ,43 ,21 ,6 ,0 ,2 ,13 ,31 ,58 ,92 ,135 ,185 ,243 ,308 ,380 ,458 ,544 ,635 ,732 ,834 ,941 ,1052 ,1168 ,1287 ,1409 ,1534 ,1660 ,1789 ,1918 ,2048 };
//
//sfr16 ADC0     = 0xbe;                 // ADC0 data
//
//int xdata adcmem[1000];
//int k=0;
unsigned int ms=0;
unsigned int sTotal=0;
void TIMER3_ISR(void) interrupt 14	   //TIME3 
{
   TMR3CN &= ~0x80;                     /* TMR3CN.7（TF3）置为0
										TF3：定时器 3 溢出标志   
										当定时器3从0xFFFF到0x0000溢出时由硬件置位。
   									    当定时器3中断被允许时， 该位置‘1’使 CPU 转向定时器 3 的中断服务程序。
									    该位不能由硬件自动清 0， 必须用软件清 0。*/
	ms++;
	if(ms>999)
	{
		ms=0;
		sTotal++;
		P5^=0x01; 						//P5.1交替闪亮
	}
}





//void ADC0_ISR(void) interrupt 15	   //ADC0 
//{
//   AD0INT = 0;                         //clear ADC conversion complete overflow   
//   DAC0L=ADC0L;
//   DAC0H=ADC0H;
//   k++;
//   if(k>999)k=0;
//   adcmem[k]=ADC0;
//   DAC1L=sintab[k/10];
//   DAC1H=(sintab[k/10])>>8;
//}